export const LOCATIONS = [
  "Пляж",
  "Школа",
  "Больница",
  "Аэропорт",
  "Ресторан",
  "Кинотеатр",
  "Торговый центр",
  "Отель",
  "Ночной клуб",
  "Парк",
  "Бассейн",
  "Университет",
  "Стадион",
  "Вокзал",
  "Музей",
  "Зоопарк",
  "Кафе",
  "Библиотека",
  "Супермаркет",
  "Парк аттракционов",
  "Кемпинг",
  "Фитнес-клуб",
  "Автомойка",
  "Офис",
  "Казино",
];

export const ITEMS = [
  "Телефон",
  "Ноутбук",
  "Рюкзак",
  "Зонт",
  "Ключи",
  "Кошелёк",
  "Очки",
  "Камера",
  "Наушники",
  "Часы",
  "Паспорт",
  "Зажигалка",
  "Фонарик",
  "Бутылка воды",
  "Книга",
  "Микрофон",
  "Мяч",
  "Планшет",
  "Зарядка",
  "Пауэрбанк",
  "Шапка",
  "Кепка",
  "Перчатки",
  "Чемодан",
  "Зеркало",
];

export function randomCode() {
  const chars = "ABCDEFGHJKLMNPQRSTUVWXYZ23456789";

  let result = "";

  for (let i = 0; i < 5; i++) {
    result += chars[Math.floor(Math.random() * chars.length)];
  }

  return result;
}

export function pick(array) {
  return array[Math.floor(Math.random() * array.length)];
}
